app/controllers/welcome_controller.rb

  def index
    Post.all.to_a
---
SELECT "posts".* FROM "posts"